{
  "_comment_": "Parental Control Categories - data file",

  "level_order": [
    "NONE", "G", "PG", "PG_13", "R", "ALL"
  ],

  "category_order": [
    "Safe", "Search", "Shopping", "Sports", "Privacy", "Dating", "Games",
    "Social", "Illegal", "Weapons", "Drugs", "Gambling", "Cyberbully",
    "Pornography", "Adult", "Anonymizers", "Suicide", "Malware"
  ],

  "descriptions": {
    "Safe": [
      "."
    ],
    "Search": [
      "Sites which provide the ability to perform searches for specific ",
      "topics or websites across the entire Internet, and which display ",
      "results in a multi-page format that allows material to be sorted ",
      "based on content, topic, or file type."
    ],
    "Shopping": [
      "."
    ],
    "Sports": [
      "Sites which analyze, promote, or providing information about ",
      "competitive sports and its fans whether official or unofficial."
    ],
    "Privacy": [
      "Sites which provide hosted online advertising intended to attract ",
      "web traffic, deliver marketing messages or capture email addresses."
    ],
    "Dating": [
      "Sites which promote or provide the opportunity for establishing ",
      "romantic relationship."
    ],
    "Games": [
      "Sites which related to the development, promotion, review, and ",
      "enjoyment of online, PC, and console videogaming."
    ],
    "Social": [
      "Sites which facilitate online socializing and the development or ",
      "maintenance of personal and professional relationships across ",
      "geographical and organizational boundaries."
    ],
    "Illegal": [
      "Sites which promote or provide the means to practice illegal or ",
      "unauthorized acts using computer-programming skills. And sites ",
      "which offer custom academic writing services for free or for ",
      "purchase. These sites are geared toward students who do not want ",
      "to write their own papers, but will download or buy previously ",
      "written or custom written papers."
    ],
    "Weapons": [
      "Sites which sell, manufacture, or describe the manufacture of weapons."
    ],
    "Drugs": [
      "Sites which promote, offer, sell, supply, encourage or otherwise ",
      "advocate the recreational or illegal use, cultivation, manufacture, ",
      "or distribution of drugs, pharmaceuticals, intoxicating plants or ",
      "chemicals and their related paraphernalia. And sites which glamorize, ",
      "glorify, tout or otherwise encourage the consumption of alcohol. And ",
      "sites which sell, glamorize, enable or encourage the use of tobacco ",
      "and tobacco-related products."
    ],
    "Gambling": [
      "."
    ],
    "Cyberbully": [
      "Sites or pages where people post targeted, deliberate and slanderous ",
      "or offensive content about other people with the INTENT to torment, ",
      "threaten, humiliate or defame them. Content is often sexual, ",
      "malicious or hostile in nature and is submitted via interactive ",
      "digital technology. And sites which advocate hostility, aggression ",
      "and the denigration of an individual or group on the basis of race, ",
      "religion, gender, nationality, ethnic origin, or other involuntary ",
      "characteristics. Sites that use purported scientific or commonly ",
      "accredited methods to justify inequality, aggression, and hostility."
    ],
    "Pornography": [
      "Sites which contain explicit material for the purpose of causing ",
      "sexual excitement or arousing lascivious interest."
    ],
    "Adult": [
      "Sites which contain sexually explicit information that is not ",
      "medical or scientific nature and yet are also not pornographic. ",
      "And sites which feature social or family nudism/naturism, nudist ",
      "camps/resorts, or „nudist-only‟ travel."
    ],
    "Anonymizers": [
      "Sites which provide anonymous access to websites through a PHP or ",
      "CGI proxy, allowing users to gain access to websites blocked by ",
      "corporate and school proxies as well as parental control filtering ",
      "solutions."
    ],
    "Suicide": [
      "Sites which advocate, normalize, or glamourize repetitive and ",
      "deliberate ways to inflict non-fatal harm to oneself. And sites ",
      "advocating or glorifying suicide as well as educating people on how ",
      "to commit suicide."
    ],
    "Malware": [
      "Sites where the domain was found to either contain malware or take ",
      "advantage of other exploits to deliver adware, spyware or malware. ",
      "And Sites that contain direct links to malware file downloads: ",
      ".exe, .dll, .ocx, and others. These URLs are generally highly malicious."
    ]
  },

  "_prohibited_comment_": [
    "Note: Level NONE allows nothing (prohibits everything)",
    "      level ALL allows everything (prohibits nothing)",
    "      Levels G, PG, PG_13, R prohibitions listed below:"
  ],

  "prohibited": {
    "G": [
      "Games", "Social", "Illegal", "Weapons", "Drugs", "Gambling",
      "Cyberbully", "Pornography", "Adult", "Anonymizers", "Suicide", "Malware"
    ],
    "PG": [
      "Social", "Illegal", "Weapons", "Drugs", "Gambling",
      "Cyberbully", "Pornography", "Adult", "Anonymizers", "Suicide", "Malware"
    ],
    "PG_13": [
      "Illegal", "Weapons", "Drugs", "Gambling",
      "Cyberbully", "Pornography", "Adult", "Anonymizers", "Suicide", "Malware"
    ],
    "R": [
      "Pornography", "Adult", "Anonymizers", "Suicide", "Malware"
    ]
  }
}
